In [1]:
#Installing pandas
#importing pandas
#Data types in pandas

In [29]:
#Table of content
#1. DATA TYPES IN PANDAS
#2. MISSING DATA
#3. GROUP BY
#4. MERGING,JOINING AND CONCATENATING
#5. OPERATIONS
#6. DATA INPUT AND OUTPUT

In [2]:
#DataTypes
#1. Series 1-dimensional
#2. DataFrames

In [31]:
import numpy as np
import pandas as pd
from numpy.random import rand

In [6]:
labels=["a","b","c"]
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [28]:
#series
pd.Series(data=my_data)

#Series may be 
#1. Python List
#2. Numpy array
#3. Dictionaries
#4. First argument is Data and other arugument is index(optinal)
#5. Series may of any data type of python
#6. Series is accessed by the help of Index and most of operaton of series is based upon index Ex: Arithmetic

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr)#we can pass index here

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [26]:
ser1=pd.Series([1,2,3,4,5],['USA','Germany','USSR','JAPAN',"England"])
ser1

USA        1
Germany    2
USSR       3
JAPAN      4
England    5
dtype: int64

In [24]:
ser2=pd.Series([5,6,7,8,3],["Italy","India","Pakistan","Turkey","England"])
ser2

Italy       5
India       6
Pakistan    7
Turkey      8
England     3
dtype: int64

In [20]:
ser1['USA']

1

In [27]:
ser1+ser2

England     8.0
Germany     NaN
India       NaN
Italy       NaN
JAPAN       NaN
Pakistan    NaN
Turkey      NaN
USA         NaN
USSR        NaN
dtype: float64

In [30]:
# DATAFRAMES
# WAYS OF CREATING DATAFRAMES
#1. USING CSV
#2. USING EXCEL
#3. FROM PYTHON DICTIONARY
#4. FROM LIST OF TUPLES
#5. FROM LIST OF DICTIONARY

In [32]:
np.random.seed(101)

In [72]:
df=pd.DataFrame(rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

In [73]:
#There are two ways to access
df['W']

A    0.097146
B    0.159560
C    0.701371
D    0.043397
E    0.500117
Name: W, dtype: float64

In [74]:
type(df['W'])

pandas.core.series.Series

In [40]:
#not recommended due to many function are accessed by same way
df.W

A    0.685306
B    0.186967
C    0.734819
D    0.402998
E    0.865100
Name: W, dtype: float64

In [75]:
#multiple column
df[['W','X']]

          W         X
A  0.097146  0.102847
B  0.159560  0.275573
C  0.701371  0.487635
D  0.043397  0.223937
E  0.500117  0.138010

In [76]:
#creation of new column
df['New']=df['W']+df['Z']
df

          W         X         Y         Z       New
A  0.097146  0.102847  0.701507  0.890480  0.987626
B  0.159560  0.275573  0.672492  0.164303  0.323863
C  0.701371  0.487635  0.680678  0.521548  1.222919
D  0.043397  0.223937  0.575205  0.120434  0.163830
E  0.500117  0.138010  0.052808  0.178277  0.678394

In [80]:
#droping column
# If we drop any column we need to pass axis=1 (axis=1 means column And axis=0 means row)
#if we did not pass inplace argument that time it gives new dataframe or if pass it modify the original one
df.drop('New',axis=1,inplace=True)

In [77]:
df

          W         X         Y         Z       New
A  0.097146  0.102847  0.701507  0.890480  0.987626
B  0.159560  0.275573  0.672492  0.164303  0.323863
C  0.701371  0.487635  0.680678  0.521548  1.222919
D  0.043397  0.223937  0.575205  0.120434  0.163830
E  0.500117  0.138010  0.052808  0.178277  0.678394

In [78]:
#drop the row
df.drop('E')

          W         X         Y         Z       New
A  0.097146  0.102847  0.701507  0.890480  0.987626
B  0.159560  0.275573  0.672492  0.164303  0.323863
C  0.701371  0.487635  0.680678  0.521548  1.222919
D  0.043397  0.223937  0.575205  0.120434  0.163830

In [81]:
df

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

In [82]:
df.shape

(5, 4)

In [85]:
#selecting rows
# Two Ways of selecting rows
#By passing string if index is string based
df.loc['E']

W    0.500117
X    0.138010
Y    0.052808
Z    0.178277
Name: E, dtype: float64

In [88]:
#if row value is not string then pass in iloc
df.iloc[4]

W    0.500117
X    0.138010
Y    0.052808
Z    0.178277
Name: E, dtype: float64

In [91]:
#Subset of rows and column like numpy
df.loc['D','Y']

0.575205086868013

In [92]:
df.loc[['A','B','C'],['W','Y']]

          W         Y
A  0.097146  0.701507
B  0.159560  0.672492
C  0.701371  0.680678